markeet04/Wi-Health/firmware/tx_csi_send/sdkconfig.defaults
# Pin target to ESP32-S3.
# All other settings mirror esp-csi/examples/get-started/csi_send/sdkconfig.defaults.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_OFFSET=0xa000
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=128
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_FREERTOS_HZ=1000

# Console -> native USB-Serial-JTAG (so the TX boot log is visible on the
# laptop COM port; not strictly required for Step 0 since the laptop only
# reads the RX, but keeps both projects consistent for future debugging).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
